app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index

    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found."
        @songs = @artist.songs
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
  def show

    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      @song = @artist.songs.find_by(id: params[:id])
      if @song.nil?
        redirect_to artist_songs_path(@artist), alert: "Song not found"
      end
    else
      @song = Song.find(params[:id])

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Baby One More Time"], ["created_at", "2020-05-26 23:48:23.203851"], ["updated_at", "2020-05-26 23:48:23.203851"], ["artist_id", 5]]
---
  def create
    @song = Song.new(song_params)

    if @song.save